{
  "project":{
    "platform": "Misercook.com",
    "desc1": "Misercook.com is a modern, responsive culinary platform designed with the convenience of users on various devices in mind. The site was built using technologies such as Angular, HTML5, CSS3, and TypeScript, ensuring smooth operation on both computers and mobile devices. Thanks to the use of responsive design based on media queries, the layout of the site automatically adapts to the screen resolution, providing optimal navigation and readability on phones, tablets, and laptops.",
    "startPage": "Homepage",
    "desc2": "The homepage of Misercook.com is clear and intuitive, with distinct sections. Users can quickly browse recently added recipes, explore their favorites, and check out the recipe of the day, which is highlighted daily.",
    "recDetail": "Recipe detail",
    "desc3": "The Recipe Detail view displays all the details of the selected recipe, including a photo of the dish, detailed instructions, and an ingredient list that can be easily added to a shopping list.",
    "categories": "Categories",
    "desc4": "Recipes have been divided into various categories to facilitate user searching and browsing. This allows users to quickly find interesting dishes in categories such as appetizers, meals for kids, desserts, or soups.",
    "createRec": "Create recipe",
    "desc5": "After logging into the website, there is an ability to add new recipes, create custom categories, and share cooking tips.",
    "shoppingList": "Shopping List",
    "desc6": "The shopping list is designed in a way that allows users to add products manually, but there is also an option to directly add all ingredients from a recipe.",
    "portaladmin": "Portal Admin",
    "desc7": "Logging into the portal provides access to many additional features, such as editing, deleting, or adding recipes, categories, and cooking tips",
    "chat": "Misercook AI assistant",
    "desc8": "AI-based chat that assists users by answering simple questions and providing support quickly and conveniently."
  },
  "header": {
    "softwareStack": "Software-Stack",
    "about": "About me",
    "myWorks": "My works",
    "contact": "Contact"
  },
  "about": {
    "header": "About me...",
    "text": "I am 36 years old and have been living in Germany for over 10 years. My professional journey led me to research food for children, medical foods, and dietary supplements in a laboratory. After 10 years in this field, I decided to change my career direction. Inspired by the idea of developing large applications that excite people and are quickly accessible worldwide, I chose to explore the field of programming. I learned HTML, CSS, TypeScript, and Angular from scratch. As a result, I created my own recipe platform, misercook.com. This new career path allows me to leverage my programming skills to develop innovative solutions and have a positive impact on the lives of others."
  },
  "myWorks": {
    "myWorks": "My works"
  },
  "contact": {
    "contactMe": "Contact me",
    "email": " E-mail:",
    "emailAddress": "halina@kukielka.net",
    "phone": "Phone number:",
    "number": "+49 163 377 9667"
  },
  "software-stack": {
    "services": "My services",
    "serv1": "Creating web applications using Angular, TypeScript, HTML, and CSS",
    "serv2": "Developing server applications in Java using the Spring Boot framework",
    "serv3": "Application testing",
    "serv4": "Deployment of Angular web applications on Linux servers",
    "serv5": "Creating layouts in GIMP.",
    "title": "Software Stack",
    "stack1": "Angular",
    "stack2": "Java Script",
    "stack3": "HTML",
    "stack4": "CSS",
    "stack5": "Type Script",
    "stack6": "Spring Boot",
    "stack7": "Git",
    "stack8": "Java",
    "stack9": "Jenkins",
    "stack10": "PostgreSQL"
  },
  "footer": {
    "imprint": "Imprint",
    "text4": "Copyright:",
    "text5": "The content and works created by the site operator on these pages are subject to German copyright law. The reproduction, editing, distribution, and any kind of exploitation beyond the limits of copyright require the written consent of the respective author or creator. Downloads and copies of these pages are only permitted for private, non-commercial use."
  }
}
