{
  "project": {
    "misercook": "Miser Cook",
    "desc1": "Miser Cook ist eine moderne, responsive kulinarische Plattform, die mit Blick auf den Komfort der Nutzer auf verschiedenen Geräten entworfen wurde. Die Seite wurde mit Technologien wie Angular, HTML5, CSS3 und TypeScript erstellt und sorgt für eine reibungslose Funktion auf Computern und mobilen Geräten. Das Backend der Plattform basiert auf Spring Boot, was eine hohe Leistung und Skalierbarkeit der Anwendung gewährleistet. Für die Datenspeicherung wird die PostgreSQL-Datenbank genutzt, die Zuverlässigkeit, Sicherheit und effizientes Datenmanagement bietet. Darüber hinaus verfügt die Website über einen intelligenten Chat, der auf dem Rasa-Framework basiert und es den Nutzern ermöglicht, mithilfe künstlicher Intelligenz zu interagieren, personalisierte Unterstützung zu erhalten und Vorschläge zu bekommen. Dank des Einsatzes von Responsive Design, das auf Media Queries basiert, passt sich das Layout der Seite automatisch an die Bildschirmauflösung an und bietet optimale Navigation und Lesbarkeit auf Handys, Tablets und Laptops. Die deutsche Version der Seite ist unter der Adresse geizhalskoch.de verfügbar.",
    "weatherApp": "Wetter App",
    "desc2": "Eine einfache, aber zugleich funktionale Wetteranwendung, die im minimalistischen Stil gestaltet wurde und mit Angular 18, TypeScript, HTML und CSS entwickelt wurde. Die Anwendung legt großen Wert auf Klarheit und Responsivität und bietet eine klare und benutzerfreundliche Oberfläche, die ein optimales Benutzererlebnis gewährleistet. Echtzeit-Wetterdaten werden aus zuverlässigen APIs wie weatherapi.com abgerufen, wobei wesentliche Informationen wie Temperatur, Luftfeuchtigkeit und Wettervorhersagen in einem intuitiven Layout präsentiert werden. Dank des responsiven Designs funktioniert die Anwendung reibungslos auf allen Geräten, von Desktops bis hin zu Smartphones, und bleibt unabhängig von der Bildschirmgröße übersichtlich und benutzerfreundlich. Diese Wetteranwendung ist ideal für Nutzer, die präzise Wetterinformationen in einem ästhetischen und auf das Wesentliche reduzierten Interface suchen.",
    "link": "Projektseite:",
    "architect": "Webseite für ein Architekturbüro",
    "desc3": "Eine einfache, aber funktionale Portfolio-Seite für ein Architekturbüro, die im minimalistischen Stil mit Angular erstellt wurde. Die Seite nutzt Angular in Kombination mit HTML, SCSS und TypeScript, um eine klare und benutzerfreundliche Oberfläche zu bieten. Sie ermöglicht die einfache Präsentation von Projektfotos in einem eleganten, organisierten Layout. Das responsive Design sorgt dafür, dass die Seite auf allen Geräten, von Desktops bis hin zu Smartphones, einwandfrei funktioniert. Diese Portfolio-Seite ist ideal für Architekten, die ihre Arbeiten in einem modernen, professionellen und ästhetischen Format präsentieren möchten."
  },
  "header": {
    "softwareStack": "Software-Stack",
    "about": "Über mich",
    "myWorks": "Meine Projekte",
    "contact": "Kontakt"
  },
  "about": {
    "header": "Über mich...",
    "text": "Programmierung ist seit jeher meine Leidenschaft, und besonders fasziniert mich die Entwicklung moderner und funktionaler Webseiten sowie Anwendungen. In meiner täglichen Arbeit nutze ich Technologien wie HTML, CSS, JavaScript, TypeScript, Angular sowie Java und Spring Boot zur Erstellung leistungsfähiger APIs. Mein Fokus liegt darauf, Lösungen zu schaffen, die nicht nur funktional, sondern auch intuitiv und benutzerfreundlich sind.\n\nKünstliche Intelligenz ist ein Bereich, der mich besonders inspiriert. Ich entwickle mich in diesem Gebiet weiter und arbeite mit Technologien wie RASA, um intelligente Konversationssysteme zu erstellen.\n\nIch lade Sie ein, sich meine Projekte anzusehen. Einige meiner für Unternehmen realisierten Arbeiten sind aus rechtlichen Gründen nicht öffentlich zugänglich, aber ich teile gerne meine privaten Projekte."
  },
  "myWorks": {
    "myWorks": "Meine Projekte"
  },
  "contact": {
    "contactMe": "Kontakt:",
    "email": " E-mail:",
    "emailAddress": "halina@kukielka.net",
    "phone": "Telefonnummer:",
    "number": "+49 163 377 9667"
  },
  "software-stack": {
    "services": "Meine Leistungen",
    "serv1": "Erstellen von Webanwendungen mit Angular, TypeScript, HTML, CSS",
    "serv2": "Entwickeln von Serveranwendungen in Java mit dem Spring Boot Framework",
    "serv3": "Anwendungstests",
    "serv4": "Deployment von Angular-Webanwendungen auf Linux-Server",
    "serv5": "Erstellen von Layouts in GIMP und Figma",
    "title": "Software Stack",
    "stack1": "TypeScript",
    "stack2": "Java Script",
    "stack3": "HTML",
    "stack4": "CSS/SCSS",
    "stack5": "Angular",
    "stack6": "Spring Boot",
    "stack7": "Git",
    "stack8": "Java",
    "stack9": "Jenkins",
    "stack10": "PostgreSQL",
    "stack11": "RASA"
  },
  "footer": {
    "imprint": "Impressum",
    "text4": "Urheberrecht:",
    "text5": "Die durch den Seitenbetreiber erstellten Inhalte und Werke auf diesen Seiten unterliegen dem deutschen Urheberrecht. Die Vervielfältigung, Bearbeitung, Verbreitung und jede Art der Verwertung außerhalb der Grenzen des Urheberrechts bedürfen der schriftlichen Zustimmung des jeweiligen Autors bzw. Erstellers. Downloads und Kopien dieser Seite sind nur für den privaten, nicht kommerziellen Gebrauch gestattet."
  }
}
