{
  "header": {
    "home": "Über mich",
    "myWorks": "Meine Projekte",
    "contact": "Kontakt"
  },
  "home": {
    "welcome": "Herzlich willkommen auf meiner Webseite!",
    "welcomeText": "Mein Name ist Halina, und ich wohne im Taunus. Ich beherrsche die Sprachen Polnisch, Englisch und Deutsch und bin stolzer Staatsbürger zweier Länder: Polen und Deutschland.\n\nLassen Sie mich zu Beginn einen Blick auf meine Ausbildung werfen. Mein Abitur habe ich mit einem Schwerpunkt auf Mathematik und erweitertem Englisch absolviert. Dabei haben mich insbesondere Mathematik, Informatik und das Erlernen von Fremdsprachen fasziniert.\n\nDirekt nach meinem Abitur habe ich eine spannende Reise angetreten. Ich habe ein Ingenieurstudium begonnen, das mich tief in die Welt des Problemlösens und der Innovation geführt hat. Mit viel Einsatz habe ich mein Ingenieurstudium erfolgreich abgeschlossen und den Weg für mein Masterstudium in Lebensmitteltechnologie und Humanernährung geebnet. Dieser Bildungsweg hat mir eine solide Grundlage verschafft, um die komplexe Beziehung zwischen Technologie und der Ernährung von Körper und Geist zu verstehen.\n\nNach meinem Abschluss hatte ich das Privileg, dem Labor-Team eines der renommiertesten Unternehmen im Bereich Lebensmittelforschung beizutreten. Hier konnte ich zu wegweisenden Projekten beitragen, die die Zukunft der Lebensmittelwissenschaft gestalten.\n\nAbseits meiner beruflichen Tätigkeit finde ich Freude in kulinarischen Kreationen. Kochen ist für mich zu einer wunderbaren Ausdrucksform geworden, die es mir ermöglicht, mit Geschmäckern zu experimentieren und die Kunst der Nahrungszubereitung für Körper und Geist zu genießen. Zusätzlich haben mich die malerischen Landschaften des Taunus und des Rheingaus dazu inspiriert, die Schönheit der Natur bei Radtouren zu erkunden. Es gibt etwas unglaublich Befreiendes daran, die Welt auf zwei Rädern zu erkunden.\n\nIn der Welt der Hobbys habe ich eine Leidenschaft entdeckt, die meinen kreativen Geist entfacht hat – das Programmieren. Seit mehreren Jahren tauche ich in die Bereiche Angular und Java Spring Boot ein und entwickle Anwendungen, die die Kluft zwischen Vorstellung und Funktionalität überbrücken.\n\nIch lade Sie ein, meine Webseite zu erkunden, auf der Sie Einblicke in meine Erfahrungen, Interessen und Bestrebungen erhalten. Vielen Dank für Ihren Besuch, und ich hoffe, dass meine Reise auf irgendeine Weise Resonanz bei Ihnen findet. Zögern Sie nicht, sich bei Fragen oder um mehr über meine Aktivitäten zu erfahren, mit mir in Verbindung zu setzen.\n\nHerzliche Grüße,"
  },
  "myWorks": {
    "myWorks": "Meine Projekte"
  },
  "contact": {
    "contactMe": "Kontakt:",
    "email": " E-mail:",
    "emailAddress": "halina@kukielka.net",
    "phone": "Telefon Nummer: +49 163 377 9667"
  }
}
