{
  "project":{
    "platform": "Miser Cook",
    "desc1": "Miser Cook is a modern, responsive culinary platform designed with user convenience across various devices in mind. The site was built using technologies such as Angular, HTML5, CSS3, and TypeScript, ensuring smooth functionality on both computers and mobile devices. The platform's backend is powered by Spring Boot, providing high performance and scalability. PostgreSQL is used as the database, ensuring reliability, security, and efficient data management. Additionally, the website features an intelligent chat powered by the Rasa framework, allowing users to interact through artificial intelligence, receive personalized assistance, and suggestions. By leveraging Responsive Design based on Media Queries, the website layout automatically adapts to screen resolutions, offering optimal navigation and readability on smartphones, tablets, and laptops.",
    "weatherApp": "Weather App",
    "desc2": "A simple yet functional weather application designed in a minimalist style, developed using Angular 18, TypeScript, HTML, and CSS. The application emphasizes clarity and responsiveness, offering a clean and user-friendly interface to ensure an optimal user experience. Real-time weather data is fetched from reliable APIs, presenting key information such as temperature, humidity, and forecasts in an intuitive layout. Thanks to its responsive design, the application runs smoothly across all devices, from desktops to smartphones, maintaining clarity and usability regardless of screen size. This weather app is perfect for users seeking accurate weather updates in a visually pleasing and streamlined interface.",
    "link": "Project website:"
  },
  "header": {
    "softwareStack": "Software-Stack",
    "about": "About me",
    "myWorks": "My works",
    "contact": "Contact"
  },
  "about": {
    "header": "About me...",
    "text": "I am a trained food technologist and worked in this profession for ten years, primarily in the research and development of foods for children, medical foods, and dietary supplements. Although I was active in this industry, programming has always fascinated me. For this reason, I decided to take a new professional path and dive into the development of modern applications.\n\nI have acquired solid knowledge in HTML, CSS, TypeScript, and Angular. This career change allows me to create innovative solutions that can reach people worldwide and have a positive impact.\n\nI invite you to explore my projects. Some of my work for companies is not publicly accessible due to legal reasons, but I am happy to share private projects."
  },
  "myWorks": {
    "myWorks": "My works"
  },
  "contact": {
    "contactMe": "Contact me",
    "email": " E-mail:",
    "emailAddress": "halina@kukielka.net",
    "phone": "Phone number:",
    "number": "+49 163 377 9667"
  },
  "software-stack": {
    "services": "My services",
    "serv1": "Creating web applications using Angular, TypeScript, HTML, and CSS",
    "serv2": "Developing server applications in Java using the Spring Boot framework",
    "serv3": "Application testing",
    "serv4": "Deployment of Angular web applications on Linux servers",
    "serv5": "Creating layouts in GIMP.",
    "title": "Software Stack",
    "stack1": "Angular",
    "stack2": "Java Script",
    "stack3": "HTML",
    "stack4": "CSS",
    "stack5": "Type Script",
    "stack6": "Spring Boot",
    "stack7": "Git",
    "stack8": "Java",
    "stack9": "Jenkins",
    "stack10": "PostgreSQL"
  },
  "footer": {
    "imprint": "Imprint",
    "text4": "Copyright:",
    "text5": "The content and works created by the site operator on these pages are subject to German copyright law. The reproduction, editing, distribution, and any kind of exploitation beyond the limits of copyright require the written consent of the respective author or creator. Downloads and copies of these pages are only permitted for private, non-commercial use."
  }
}
