{
  "header": {
    "home": "About me",
    "myWorks": "My works",
    "contact": "Contact"
  },

  "home": {
    "welcome": "Hello and welcome",
    "welcomeText": "My name is Halina, and I'm based in the enchanting region of Taunus. I'm a multilingual individual, fluent in Polish, English, and German, and I proudly hold dual citizenship in Poland and Germany.\n\nLet's start by diving into my educational journey. I graduated from high school with a strong emphasis on mathematics and extended English studies. Among the subjects that truly captured my interest were mathematics, computer science, and the captivating world of foreign languages.\n\nFollowing my high school graduation, I embarked on an exciting path. I embarked on engineering studies, immersing myself in the realm of problem-solving and innovation. With dedication and hard work, I successfully completed my engineering studies, which paved the way for my pursuit of a master's degree in food technology and human nutrition. This educational journey provided me with a solid foundation in understanding the intricate relationship between technology and the nourishment of both body and soul.\n\nPost-graduation, I had the privilege of joining the laboratory team at one of the most esteemed food research companies. Here, I've been fortunate to contribute to groundbreaking projects that are shaping the future of food science.\n\nOutside of my professional pursuits, I find joy in culinary creations. Cooking has become a delightful outlet for me, allowing me to experiment with flavors and indulge in the art of nourishing both body and mind. Additionally, the picturesque landscapes of the Taunus and Rhaingau regions have inspired me to explore the beauty of nature through cycling adventures. There's something truly liberating about exploring the world on two wheels.\n\nIn the realm of hobbies, I stumbled upon a passion that ignited my creative spirit—programming. For several years now, I've been diving into the realms of Angular and Java Spring Boot, crafting applications that bridge the gap between imagination and functionality.\n\nI invite you to explore my website, where you'll find a glimpse into my experiences, interests, and aspirations. Thank you for visiting, and I hope my journey resonates with you in some way. Feel free to reach out if you'd like to connect or learn more about my endeavors.\n\nWarmest regards, Halina"
  },

  "myWorks": {
    "myWorks": "My works"
  },
  "contact": {
    "contactMe": "Contact me",
    "email": " E-mail:",
    "emailAddress": "halina@kukielka.net",
    "phone": "Phone number: +49 163 377 9667"
  }
}
